app/views/gossips/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
<div>
  <h4>Comment by <%= comment.user.first_name %> <%= comment.user.last_name %></h4>