app/views/gossips/show.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
                <%= @gossip.content %> <br> </h5>
                <p class="card-text">Author : <%= @gossip.user.first_name %> <%= @gossip.user.last_name %>  <%= link_to "Read more...", user_path(@gossip.user.id) %> </p>

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 30]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 30]]
---

        <h5>Likes (<%= @gossip.comments.size %>)</h5>