app/controllers/cities_controller.rb

  def show
    @city = City.find(params[:id])
    @users = User.where("city_id = ?", params[:id])
    @gossips = Gossip.all
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE (user_id = 8)