app/controllers/gossips_controller.rb

  def create

  	puts "$" * 60
    puts "ceci est le contenu de params :"
    puts params
    puts "$" * 60

    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: params[:user_id])


    puts "$" * 60
    puts "ceci est mon objet Gossip :"
    puts @gossip.title
	puts @gossip.content
	puts @gossip.user_id
	puts @gossip.user.first_name
	puts @gossip.user.last_name
    puts "$" * 60


    if @gossip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "JUNE"], ["content", "JULY"], ["user_id", 8], ["created_at", "2019-02-06 10:25:39.991805"], ["updated_at", "2019-02-06 10:25:39.991805"]]

  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "user_id" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Kik"], ["user_id", 8], ["updated_at", "2019-02-06 11:03:07.408175"], ["id", 1]]