app/controllers/thegossipcontroller_controller.rb

	def home
		@gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

	def gossip_page
		@mygossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

	def author_page
		@myauthor = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]