app/views/thegossipcontroller/gossip_page.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
      <td>
      	<p> <%= @mygossip.user.first_name %> <%= @mygossip.user.last_name %> </p>