app/views/thegossipcontroller/home.html.erb

		  <div class="card-header" >
		    <%= gossip.user.first_name %> <%= gossip.user.last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]